src/test/java/Config/payload.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:sap-com:document:sap:rfc:functions">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:_-PROS_-MDO_MATERIAL_MASTER_V2>
         <IT_MATERIALDESCRIPTION>
    <item>
      <MATL_DESC>TEST BALL BEARING</MATL_DESC>
    </item>
  </IT_MATERIALDESCRIPTION>
  <IW_DIMENSIONS>
    <VOLUME_UNIT>L</VOLUME_UNIT>
  </IW_DIMENSIONS>
  <IW_MDOREQUESTDETAIL>
    <SCENARIO_ID>01</SCENARIO_ID>
  </IW_MDOREQUESTDETAIL>
  <IW_HEADDATA>
    <IND_SECTOR>C</IND_SECTOR>
    <MATL_TYPE>ERSA</MATL_TYPE>
    <BASIC_VIEW>X</BASIC_VIEW>
    <PURCHASE_VIEW>X</PURCHASE_VIEW>
    <MRP_VIEW>X</MRP_VIEW>
    <STORAGE_VIEW>X</STORAGE_VIEW>
    <QUALITY_VIEW>X</QUALITY_VIEW>
    <ACCOUNT_VIEW>X</ACCOUNT_VIEW>
  </IW_HEADDATA>
  <IT_UNITSOFMEASURE>
    <item>
      <NUMERATOR>1</NUMERATOR>
      <ALT_UNIT>Bag</ALT_UNIT>
      <DENOMINATR>1</DENOMINATR>
    </item>
  </IT_UNITSOFMEASURE>
  <IW_VALUATIONDATA>
    <VAL_TYPE>N.A</VAL_TYPE>
    <PRICE_CTRL>V</PRICE_CTRL>
    <MOVING_PR>33</MOVING_PR>
    <PRICE_UNIT>5</PRICE_UNIT>
    <VAL_CLASS>3040</VAL_CLASS>
    <VAL_CAT>A</VAL_CAT>
    <VAL_AREA>0001</VAL_AREA>
  </IW_VALUATIONDATA>
  <IW_VALUATIONDATA>
    <VAL_TYPE>N.A</VAL_TYPE>
    <PRICE_CTRL>V</PRICE_CTRL>
    <MOVING_PR>22</MOVING_PR>
    <PRICE_UNIT>5</PRICE_UNIT>
    <VAL_CLASS>3040</VAL_CLASS>
    <VAL_CAT>A</VAL_CAT>
    <VAL_AREA>0002</VAL_AREA>
  </IW_VALUATIONDATA>
  <IW_PLANTDATA>
    <MRP_CTRLER>001</MRP_CTRLER>
    <LOADINGGRP>0001</LOADINGGRP>
    <PLANT>0001</PLANT>
    <ABC_ID>A</ABC_ID>
    <AVAILCHECK>CH</AVAILCHECK>
    <MRP_TYPE>ND</MRP_TYPE>
    <MRP_GROUP>0001</MRP_GROUP>
  </IW_PLANTDATA>
  <IW_PLANTDATA>
    <PLANT>0002</PLANT>
    <ABC_ID>B</ABC_ID>
    <AVAILCHECK>02</AVAILCHECK>
    <MRP_TYPE>ND</MRP_TYPE>
    <MRP_GROUP>0001</MRP_GROUP>
  </IW_PLANTDATA>
  <IW_CLIENTDATA>
    <MATL_GROUP>40141741</MATL_GROUP>
    <UNIT_OF_WT>KG</UNIT_OF_WT>
    <BASE_UOM>EA</BASE_UOM>
    <MANU_MAT>0001</MANU_MAT>
    <EXTMATLGRP>00102</EXTMATLGRP>
  </IW_CLIENTDATA>
  <IW_CLIENTDATA>
    <MATL_GROUP>40141741</MATL_GROUP>
    <UNIT_OF_WT>KG</UNIT_OF_WT>
    <BASE_UOM>EA</BASE_UOM>
    <MANU_MAT>0001</MANU_MAT>
    <EXTMATLGRP>00102</EXTMATLGRP>
  </IW_CLIENTDATA>
  <MDO_PROCESSING_DATA>
    <recordNumber>ERSA038265</recordNumber>
    <moduleId>504349</moduleId>
    <tenantId>776099</tenantId>
    <crId>614510625143782538</crId>
    <processId>49874</processId>
    <eventId>1</eventId>
    <taskId>102929</taskId>
    <layoutId>dfb320b2-53d9-47a9-ab38-73e0f4b6d6ca</layoutId>
    <userId>auto_reviewer@yopmail.com</userId>
    <processFlowContainerId>AutoIntegration_1.0.0</processFlowContainerId>
    <processFlowId>AutoIntegration.AutoIntegration</processFlowId>
    <draft>false</draft>
    <messageLogId>12ecefda-8e16-4903-a244-04c9fa32c168</messageLogId>
    <scenarioId>5b359b03-d2e6-4572-a8ec-18e08b6e6e78</scenarioId>
    <USERCREATED>ce7dacf4-7140-46fa-9135-a8fc9af1b618</USERCREATED>
  </MDO_PROCESSING_DATA>
      </urn:_-PROS_-MDO_MATERIAL_MASTER_V2>
   </soapenv:Body>
</soapenv:Envelope>